# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Mon Jul 15 12:13:22 EDT 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design aska_dig

create_clock -name "CLK" -period 20.0 -waveform {0.0 10.0} [get_ports clk]
create_clock -name "SPI_CLK" -period 20.0 -waveform {0.0 10.0} [get_ports SPI_Clk]
set_load -pin_load -min 0.01 [get_ports {up_switches[31]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[31]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[30]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[30]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[29]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[29]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[28]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[28]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[27]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[27]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[26]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[26]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[25]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[25]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[24]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[24]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[23]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[23]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[22]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[22]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[21]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[21]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[20]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[20]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[19]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[19]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[18]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[18]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[17]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[17]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[16]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[16]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[15]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[15]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[14]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[14]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[13]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[13]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[12]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[12]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[11]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[11]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[10]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[10]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[9]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[9]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[8]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[8]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[7]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[7]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[6]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[6]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[5]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[5]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[4]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[4]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[3]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[3]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[2]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[2]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[1]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[1]}]
set_load -pin_load -min 0.01 [get_ports {up_switches[0]}]
set_load -pin_load -max 1.0 [get_ports {up_switches[0]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[31]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[31]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[30]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[30]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[29]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[29]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[28]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[28]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[27]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[27]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[26]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[26]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[25]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[25]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[24]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[24]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[23]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[23]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[22]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[22]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[21]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[21]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[20]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[20]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[19]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[19]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[18]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[18]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[17]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[17]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[16]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[16]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[15]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[15]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[14]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[14]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[13]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[13]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[12]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[12]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[11]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[11]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[10]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[10]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[9]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[9]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[8]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[8]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[7]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[7]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[6]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[6]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[5]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[5]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[4]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[4]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[3]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[3]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[2]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[2]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[1]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[1]}]
set_load -pin_load -min 0.01 [get_ports {down_switches[0]}]
set_load -pin_load -max 1.0 [get_ports {down_switches[0]}]
set_load -pin_load -min 0.01 [get_ports {DAC[5]}]
set_load -pin_load -max 1.0 [get_ports {DAC[5]}]
set_load -pin_load -min 0.01 [get_ports {DAC[4]}]
set_load -pin_load -max 1.0 [get_ports {DAC[4]}]
set_load -pin_load -min 0.01 [get_ports {DAC[3]}]
set_load -pin_load -max 1.0 [get_ports {DAC[3]}]
set_load -pin_load -min 0.01 [get_ports {DAC[2]}]
set_load -pin_load -max 1.0 [get_ports {DAC[2]}]
set_load -pin_load -min 0.01 [get_ports {DAC[1]}]
set_load -pin_load -max 1.0 [get_ports {DAC[1]}]
set_load -pin_load -min 0.01 [get_ports {DAC[0]}]
set_load -pin_load -max 1.0 [get_ports {DAC[0]}]
set_load -pin_load -min 0.01 [get_ports pulse_active]
set_load -pin_load -max 1.0 [get_ports pulse_active]
set_load -pin_load -min 0.01 [get_ports enable]
set_load -pin_load -max 1.0 [get_ports enable]
set_false_path -from [get_ports reset_l]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {up_switches[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {down_switches[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {DAC[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {DAC[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {DAC[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {DAC[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {DAC[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports {DAC[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports pulse_active]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -max 10.0 [get_ports enable]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {up_switches[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[31]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[30]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[29]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[28]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[27]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[26]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[25]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[24]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[23]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[22]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[21]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[20]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[19]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[18]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[17]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[16]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[15]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[14]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[13]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[12]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[11]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[10]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[9]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[8]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[7]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[6]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {down_switches[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {DAC[5]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {DAC[4]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {DAC[3]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {DAC[2]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {DAC[1]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports {DAC[0]}]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports pulse_active]
set_output_delay -clock [get_clocks CLK] -network_latency_included -add_delay -min 0.1 [get_ports enable]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -max 10.0 [get_ports reset_l]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -max 10.0 [get_ports porborn]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -max 10.0 [get_ports SPI_CS]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -max 10.0 [get_ports SPI_MOSI]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -max 10.0 [get_ports {IC_addr[1]}]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -max 10.0 [get_ports {IC_addr[0]}]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -min 0.1 [get_ports reset_l]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -min 0.1 [get_ports porborn]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -min 0.1 [get_ports SPI_CS]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -min 0.1 [get_ports SPI_MOSI]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -min 0.1 [get_ports {IC_addr[1]}]
set_input_delay -clock [get_clocks SPI_CLK] -network_latency_included -add_delay -min 0.1 [get_ports {IC_addr[0]}]
set_operating_conditions slow_3_00V_125C
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports clk]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports clk]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports reset_l]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports reset_l]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports porborn]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports porborn]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports SPI_CS]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports SPI_CS]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports SPI_Clk]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports SPI_Clk]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports SPI_MOSI]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports SPI_MOSI]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports {IC_addr[1]}]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports {IC_addr[1]}]
set_driving_cell -min -lib_cell BUJI3VX2 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports {IC_addr[0]}]
set_driving_cell -max -lib_cell BUJI3VX16 -library D_CELLS_JI3V_LPMOS_MOS3LP_slow_3_00V_125C -pin "Q" [get_ports {IC_addr[0]}]
set_wire_load_mode "enclosed"
set_clock_latency  2.0 [get_clocks CLK]
set_clock_uncertainty -setup 2.0 [get_clocks CLK]
set_clock_uncertainty -hold 0.4 [get_clocks CLK]
set_clock_latency  2.0 [get_clocks SPI_CLK]
set_clock_uncertainty -setup 2.0 [get_clocks SPI_CLK]
set_clock_uncertainty -hold 0.4 [get_clocks SPI_CLK]
